// 1. Выведите в консоль результат деления числа 100 на 4.
console.log(100 / 4);


// 2. Реализуйте программу, которая вычисляет и выводит на
//  экран значение выражения: 8 / 2 + 5 - -3 / 2
console.log(8 / 2 + 5 - -3 / 2);

// 3.Выведите в консоль следующую фразу, используя конкатенацию: Lorem ipsum dolor sit amet
let a = 'Lorem';
let b = 'ipsum';
let c = 'dolor';
let d = 'sit';
let e = 'amet';

console.log('используя конкатенацию: ' + a +' '  + b + ' ' + c + ' ' + d + ' ' + e);

// 4.Выведите фразу из предыдущего задания в консоль, используя интерполяцию.
console.log(`используя интерполяцию: ${a} ${b} ${c} ${d} ${e}`);

// 5.Создайте переменную number и присвойте ей значение 8. 
// Затем переопределите значение - задайте новое значение 15. Выведите новое значение переменной в консоль.
let number = 8;
number = 15;
console.log(number);

// 6.Создайте переменную sum, которая будет выполнять операцию возведения в квадрат числа 8.
//  Выведите переменную sum в консоль.
let sum = 8 ** 2;
console.log(sum);

// 7.Создайте две переменные firstname и lastname.
//  Присвойте им произвольные значения. Выведите в консоль строку в формате ‘Имя Фамилия’
let firstName = 'Aigars';
let lastName = 'Alutis';
console.log('\'' + firstName + ' ' + lastName + '\'');

