// Напишите цикл for, который выводит числа в консоль от 100 до 130.

// for (let i = 100; i <= 130; i++) {
//   console.log(i);
// }
// -----------------------------------------------------------------------------------

// Напишите цикл for, который выводит числа в консоль от 196 до 110 с шагом 3.

// for (let i = 196; i >= 110; i -= 3) {
//   console.log(i);
// }

// --------------------------------------------------------------------------------------

// Second level: 4. В программе заданы две переменные n и m с числовым значением каждая. Напишите цикл,
//  который считает сумму четных чисел и нечетных чисел от n до m.
//   Суммы выведите в консоль (в начале сумму четных чисел, а затем сумму нечетных).

// const n = 20;
// const m = 60;
// let sumEven = 0;
// let sumOdd = 0;
// for (let i = n; i <= m; i++) {
//   if (i % 2 === 0) {
//     sumEven += i;
//   } else {
//     sumOdd += i;
//   }
// }
// console.log(sumEven);
// console.log(sumOdd);

// -----------------------------------------------------------------------------------

// В программе задана переменная n. Напишите программу, которая с помощью цикла считает сумму чисел от 1 до n и выводит в консоль.

// let n;
// let sum = 0;
// for (let i = 1; i <= n; i++) {
//   sum += i;
// }
// console.log(sum);
